app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "precious"], ["email", "udegbue69@gmail.com"], ["password", "precious"], ["created_at", "2020-06-04 12:48:17.358502"], ["updated_at", "2020-06-04 12:48:17.358502"]]
---
  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)
    if @user.save